builder/tests/artillery/scenarios/ws.scenarios.yaml
config:
  target: 'wss://builder-shops.test.devpayever.com/ws'
  phases:
    - duration: 10
      arrivalRate: 1

# @deprecated, need to change it to socket io to check response
scenarios:
  - name: WebSocket test
    engine: ws
    flow:
      - send: {"event":"get.shape.album","data":{"id":"c9edd500-bff1-430f-b34e-04ad5d737073","token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoiNjY0MmY2ZTMtN2Y2Mi00MDMwLWI0ZGQtZjliOGNmMDc2NmExIiwiZW1haWwiOiJkZW5pcy5vc3RhcGVua29AcGF5ZXZlci5vcmciLCJmaXJzdE5hbWUiOiJEZW5pcyIsImxhc3ROYW1lIjoiT3N0YXBlbmtvIiwicm9sZXMiOlt7Im5hbWUiOiJtZXJjaGFudCIsInBlcm1pc3Npb25zIjpbXSwiYXBwbGljYXRpb25zIjpbXX0seyJwZXJtaXNzaW9ucyI6W10sIm5hbWUiOiJ1c2VyIiwiYXBwbGljYXRpb25zIjpbXX1dLCJ0b2tlbklkIjoiZWQ5Y2JlNDgtNmE5NS00NWUyLTk3NjAtMGIwNzE0OTdjNGY2IiwidG9rZW5UeXBlIjowLCJjbGllbnRJZCI6bnVsbCwiaGFzaCI6Ijc3ZTE3NGI3MmYzOTcyNDdiYWU5MTA4NDQ5YmUwMTIxY2IyNTc2NThlMGZmYjlkMzgxMWYyNTc4YTQyODc1N2QiLCJyZW1vdmVQcmV2aW91c1Rva2VucyI6dHJ1ZX0sImlhdCI6MTY2NTY3MjQ0OCwiZXhwIjoxODY1NzU4ODQ4fQ.RmNwKPX1cV0zAtQnCZOPvetGx5LdotUkTun60n54Q7c","params":{"pagination":{"offset":0,"limit":100}}}}
      - think: 5
      - send: {"event":"get.shape","data":{"id":"c9edd500-bff1-430f-b34e-04ad5d737073","token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoiNjY0MmY2ZTMtN2Y2Mi00MDMwLWI0ZGQtZjliOGNmMDc2NmExIiwiZW1haWwiOiJkZW5pcy5vc3RhcGVua29AcGF5ZXZlci5vcmciLCJmaXJzdE5hbWUiOiJEZW5pcyIsImxhc3ROYW1lIjoiT3N0YXBlbmtvIiwicm9sZXMiOlt7Im5hbWUiOiJtZXJjaGFudCIsInBlcm1pc3Npb25zIjpbXSwiYXBwbGljYXRpb25zIjpbXX0seyJwZXJtaXNzaW9ucyI6W10sIm5hbWUiOiJ1c2VyIiwiYXBwbGljYXRpb25zIjpbXX1dLCJ0b2tlbklkIjoiZWQ5Y2JlNDgtNmE5NS00NWUyLTk3NjAtMGIwNzE0OTdjNGY2IiwidG9rZW5UeXBlIjowLCJjbGllbnRJZCI6bnVsbCwiaGFzaCI6Ijc3ZTE3NGI3MmYzOTcyNDdiYWU5MTA4NDQ5YmUwMTIxY2IyNTc2NThlMGZmYjlkMzgxMWYyNTc4YTQyODc1N2QiLCJyZW1vdmVQcmV2aW91c1Rva2VucyI6dHJ1ZX0sImlhdCI6MTY2NTY3MjQ0OCwiZXhwIjoxODY1NzU4ODQ4fQ.RmNwKPX1cV0zAtQnCZOPvetGx5LdotUkTun60n54Q7c","params":{"applicationId":"ddaa8c3e-7d11-4c46-8f8f-ce409f30dbf1","pagination":{"offset":0,"limit":100}}}}
      - think: 5
      - send: {"event":"update.snapshot.application","data":{"id":"8185c36c-1eea-483a-91f2-7b9496f47d84","token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoiNjY0MmY2ZTMtN2Y2Mi00MDMwLWI0ZGQtZjliOGNmMDc2NmExIiwiZW1haWwiOiJkZW5pcy5vc3RhcGVua29AcGF5ZXZlci5vcmciLCJmaXJzdE5hbWUiOiJEZW5pcyIsImxhc3ROYW1lIjoiT3N0YXBlbmtvIiwicm9sZXMiOlt7Im5hbWUiOiJtZXJjaGFudCIsInBlcm1pc3Npb25zIjpbXSwiYXBwbGljYXRpb25zIjpbXX0seyJwZXJtaXNzaW9ucyI6W10sIm5hbWUiOiJ1c2VyIiwiYXBwbGljYXRpb25zIjpbXX1dLCJ0b2tlbklkIjoiZWQ5Y2JlNDgtNmE5NS00NWUyLTk3NjAtMGIwNzE0OTdjNGY2IiwidG9rZW5UeXBlIjowLCJjbGllbnRJZCI6bnVsbCwiaGFzaCI6Ijc3ZTE3NGI3MmYzOTcyNDdiYWU5MTA4NDQ5YmUwMTIxY2IyNTc2NThlMGZmYjlkMzgxMWYyNTc4YTQyODc1N2QiLCJyZW1vdmVQcmV2aW91c1Rva2VucyI6dHJ1ZX0sImlhdCI6MTY2NTY3MjQ0OCwiZXhwIjoxODY1NzU4ODQ4fQ.RmNwKPX1cV0zAtQnCZOPvetGx5LdotUkTun60n54Q7c","params":{"themeId":"830e2ad8-17c0-4d07-9ba8-113228ac7d21","routing":[{"routeId":"db81aed3-b780-4417-bff3-612f8e424bb8","url":"artillery","pageId":"ffefa6c8-d08b-479e-9bc0-1790eec70275"}]}}}
      - think: 5
      - send: {"event":"create.pages","data":{"id":"a4a132fc-6bf2-4d0b-8f4f-a90fd85264a4","token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoiNjY0MmY2ZTMtN2Y2Mi00MDMwLWI0ZGQtZjliOGNmMDc2NmExIiwiZW1haWwiOiJkZW5pcy5vc3RhcGVua29AcGF5ZXZlci5vcmciLCJmaXJzdE5hbWUiOiJEZW5pcyIsImxhc3ROYW1lIjoiT3N0YXBlbmtvIiwicm9sZXMiOlt7Im5hbWUiOiJtZXJjaGFudCIsInBlcm1pc3Npb25zIjpbXSwiYXBwbGljYXRpb25zIjpbXX0seyJwZXJtaXNzaW9ucyI6W10sIm5hbWUiOiJ1c2VyIiwiYXBwbGljYXRpb25zIjpbXX1dLCJ0b2tlbklkIjoiZWQ5Y2JlNDgtNmE5NS00NWUyLTk3NjAtMGIwNzE0OTdjNGY2IiwidG9rZW5UeXBlIjowLCJjbGllbnRJZCI6bnVsbCwiaGFzaCI6Ijc3ZTE3NGI3MmYzOTcyNDdiYWU5MTA4NDQ5YmUwMTIxY2IyNTc2NThlMGZmYjlkMzgxMWYyNTc4YTQyODc1N2QiLCJyZW1vdmVQcmV2aW91c1Rva2VucyI6dHJ1ZX0sImlhdCI6MTY2NTY3MjQ0OCwiZXhwIjoxODY1NzU4ODQ4fQ.RmNwKPX1cV0zAtQnCZOPvetGx5LdotUkTun60n54Q7c","params":{"themeId":"830e2ad8-17c0-4d07-9ba8-113228ac7d21","pages":[{"id":"1f892bd6-366b-48a3-8af9-2aad11ae4d42","name":"About","variant":"default","type":"replica","master":null,"data":null,"prev":null,"next":null}]}}}
      - think: 5
      - send: {"event":"update.page","data":{"id":"36783b34-ad2b-42a1-922b-7738654ba235","token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoiNjY0MmY2ZTMtN2Y2Mi00MDMwLWI0ZGQtZjliOGNmMDc2NmExIiwiZW1haWwiOiJkZW5pcy5vc3RhcGVua29AcGF5ZXZlci5vcmciLCJmaXJzdE5hbWUiOiJEZW5pcyIsImxhc3ROYW1lIjoiT3N0YXBlbmtvIiwicm9sZXMiOlt7Im5hbWUiOiJtZXJjaGFudCIsInBlcm1pc3Npb25zIjpbXSwiYXBwbGljYXRpb25zIjpbXX0seyJwZXJtaXNzaW9ucyI6W10sIm5hbWUiOiJ1c2VyIiwiYXBwbGljYXRpb25zIjpbXX1dLCJ0b2tlbklkIjoiZWQ5Y2JlNDgtNmE5NS00NWUyLTk3NjAtMGIwNzE0OTdjNGY2IiwidG9rZW5UeXBlIjowLCJjbGllbnRJZCI6bnVsbCwiaGFzaCI6Ijc3ZTE3NGI3MmYzOTcyNDdiYWU5MTA4NDQ5YmUwMTIxY2IyNTc2NThlMGZmYjlkMzgxMWYyNTc4YTQyODc1N2QiLCJyZW1vdmVQcmV2aW91c1Rva2VucyI6dHJ1ZX0sImlhdCI6MTY2NTY3MjQ0OCwiZXhwIjoxODY1NzU4ODQ4fQ.RmNwKPX1cV0zAtQnCZOPvetGx5LdotUkTun60n54Q7c","params":{"themeId":"830e2ad8-17c0-4d07-9ba8-113228ac7d21","pages":[{"pageId":"ffefa6c8-d08b-479e-9bc0-1790eec70275","name":"testing artillery"}]}}}
      - think: 5
      - send: {"event":"json.patch.listener","data":{"id":"b60f2834-87fb-4e36-88f8-49e923fa683b","token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoiNjY0MmY2ZTMtN2Y2Mi00MDMwLWI0ZGQtZjliOGNmMDc2NmExIiwiZW1haWwiOiJkZW5pcy5vc3RhcGVua29AcGF5ZXZlci5vcmciLCJmaXJzdE5hbWUiOiJEZW5pcyIsImxhc3ROYW1lIjoiT3N0YXBlbmtvIiwicm9sZXMiOlt7Im5hbWUiOiJtZXJjaGFudCIsInBlcm1pc3Npb25zIjpbXSwiYXBwbGljYXRpb25zIjpbXX0seyJwZXJtaXNzaW9ucyI6W10sIm5hbWUiOiJ1c2VyIiwiYXBwbGljYXRpb25zIjpbXX1dLCJ0b2tlbklkIjoiZWQ5Y2JlNDgtNmE5NS00NWUyLTk3NjAtMGIwNzE0OTdjNGY2IiwidG9rZW5UeXBlIjowLCJjbGllbnRJZCI6bnVsbCwiaGFzaCI6Ijc3ZTE3NGI3MmYzOTcyNDdiYWU5MTA4NDQ5YmUwMTIxY2IyNTc2NThlMGZmYjlkMzgxMWYyNTc4YTQyODc1N2QiLCJyZW1vdmVQcmV2aW91c1Rva2VucyI6dHJ1ZX0sImlhdCI6MTY2NTY3MjQ0OCwiZXhwIjoxODY1NzU4ODQ4fQ.RmNwKPX1cV0zAtQnCZOPvetGx5LdotUkTun60n54Q7c","params":{"themeId":"830e2ad8-17c0-4d07-9ba8-113228ac7d21","pageId":"ffefa6c8-d08b-479e-9bc0-1790eec70275"}}}
      - think: 5
      - send: {"event":"json.patch.element","data":{"id":"b60f2834-87fb-4e36-88f8-49e923fa683b","token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoiNjY0MmY2ZTMtN2Y2Mi00MDMwLWI0ZGQtZjliOGNmMDc2NmExIiwiZW1haWwiOiJkZW5pcy5vc3RhcGVua29AcGF5ZXZlci5vcmciLCJmaXJzdE5hbWUiOiJEZW5pcyIsImxhc3ROYW1lIjoiT3N0YXBlbmtvIiwicm9sZXMiOlt7Im5hbWUiOiJtZXJjaGFudCIsInBlcm1pc3Npb25zIjpbXSwiYXBwbGljYXRpb25zIjpbXX0seyJwZXJtaXNzaW9ucyI6W10sIm5hbWUiOiJ1c2VyIiwiYXBwbGljYXRpb25zIjpbXX1dLCJ0b2tlbklkIjoiZWQ5Y2JlNDgtNmE5NS00NWUyLTk3NjAtMGIwNzE0OTdjNGY2IiwidG9rZW5UeXBlIjowLCJjbGllbnRJZCI6bnVsbCwiaGFzaCI6Ijc3ZTE3NGI3MmYzOTcyNDdiYWU5MTA4NDQ5YmUwMTIxY2IyNTc2NThlMGZmYjlkMzgxMWYyNTc4YTQyODc1N2QiLCJyZW1vdmVQcmV2aW91c1Rva2VucyI6dHJ1ZX0sImlhdCI6MTY2NTY3MjQ0OCwiZXhwIjoxODY1NzU4ODQ4fQ.RmNwKPX1cV0zAtQnCZOPvetGx5LdotUkTun60n54Q7c","params":{"themeId":"830e2ad8-17c0-4d07-9ba8-113228ac7d21","pageId":"ffefa6c8-d08b-479e-9bc0-1790eec70275","patches":[{"op":"replace","path":["aff0c370-2a18-46ab-937f-332552ab97e7","next"],"value":"066666ca-1632-1432-1532-68fb2ee5697a"}],"inversePatches":[{"op":"replace","path":["aff0c370-2a18-46ab-937f-332552ab97e7","next"],"value":"123"}]}}}
      - think: 5
      - send: {"event":"publish","data":{"params":{"themeId":"830e2ad8-17c0-4d07-9ba8-113228ac7d21"},"id":"50540f6e-9cb8-4700-a16c-f86f266a8789","token":"eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyIjp7ImlkIjoiNjY0MmY2ZTMtN2Y2Mi00MDMwLWI0ZGQtZjliOGNmMDc2NmExIiwiZW1haWwiOiJkZW5pcy5vc3RhcGVua29AcGF5ZXZlci5vcmciLCJmaXJzdE5hbWUiOiJEZW5pcyIsImxhc3ROYW1lIjoiT3N0YXBlbmtvIiwicm9sZXMiOlt7Im5hbWUiOiJtZXJjaGFudCIsInBlcm1pc3Npb25zIjpbXSwiYXBwbGljYXRpb25zIjpbXX0seyJwZXJtaXNzaW9ucyI6W10sIm5hbWUiOiJ1c2VyIiwiYXBwbGljYXRpb25zIjpbXX1dLCJ0b2tlbklkIjoiZWQ5Y2JlNDgtNmE5NS00NWUyLTk3NjAtMGIwNzE0OTdjNGY2IiwidG9rZW5UeXBlIjowLCJjbGllbnRJZCI6bnVsbCwiaGFzaCI6Ijc3ZTE3NGI3MmYzOTcyNDdiYWU5MTA4NDQ5YmUwMTIxY2IyNTc2NThlMGZmYjlkMzgxMWYyNTc4YTQyODc1N2QiLCJyZW1vdmVQcmV2aW91c1Rva2VucyI6dHJ1ZX0sImlhdCI6MTY2NTY3MjQ0OCwiZXhwIjoxODY1NzU4ODQ4fQ.RmNwKPX1cV0zAtQnCZOPvetGx5LdotUkTun60n54Q7c"}}
      - think: 5